## Getting and knowing Data

In [3]:
import pandas as pd
import numpy as np

## Step1

In [4]:
df = pd.read_csv("chipotle.tsv",sep = "\t")

In [5]:
df.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [6]:
df.shape

(4622, 5)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [10]:
#print all column name
list(df.columns)

['order_id', 'quantity', 'item_name', 'choice_description', 'item_price']

In [11]:
df.index

RangeIndex(start=0, stop=4622, step=1)

In [14]:
df.describe(include="all")

           order_id     quantity     item_name choice_description item_price
count   4622.000000  4622.000000          4622               3376       4622
unique          NaN          NaN            50               1043         78
top             NaN          NaN  Chicken Bowl        [Diet Coke]     $8.75
freq            NaN          NaN           726                134        730
mean     927.254868     1.075725           NaN                NaN        NaN
std      528.890796     0.410186           NaN                NaN        NaN
min        1.000000     1.000000           NaN                NaN        NaN
25%      477.250000     1.000000           NaN                NaN        NaN
50%      926.000000     1.000000           NaN                NaN        NaN
75%     1393.000000     1.000000           NaN                NaN        NaN
max     1834.000000    15.000000           NaN                NaN        NaN

## loc vs iloc

In [15]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [25]:
df.loc[(df.item_name == "Nantucket Nectar") & (df.quantity == 2)]

,order_id,quantity,item_name,choice_description,item_price
601,247,2,Nantucket Nectar,[Pineapple Orange Banana],$6.78
2379,947,2,Nantucket Nectar,[Peach Orange],$6.78

In [26]:
df.iloc[10]

order_id                                5
quantity                                1
item_name             Chips and Guacamole
choice_description                    NaN
item_price                         $4.45
Name: 10, dtype: object

In [27]:
 type(df.iloc[10])

pandas.core.series.Series

In [32]:
df.iloc[[10]]

    order_id  quantity            item_name choice_description item_price
10         5         1  Chips and Guacamole                NaN     $4.45

In [33]:
df.iloc[3:11]

,order_id,quantity,item_name,choice_description,item_price
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25
10,5,1,Chips and Guacamole,NaN,$4.45

In [34]:
df.iloc[3:6, :-1]

,order_id,quantity,item_name,choice_description
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans..."
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou..."

## Data Manipulation

In [51]:
 df.item_price.dtype

dtype('float64')

## Apply

In [53]:
# df.item_price = df.item_price.apply(lambda x : float(x.replace('$','')))

In [52]:
df.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

## thêm một cột total_price

In [60]:
df["total_price"] = df["quantity"]*df["item_price"]

In [ ]:
# df.total_price = df.quantity*df.item_price

In [61]:
df.head()

,order_id,quantity,item_name,choice_description,item_price,total_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39,2.39
1,1,1,Izze,[Clementine],3.39,3.39
2,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,33.96

## How much the revenue for the period in the dataset ?

In [62]:
df["total_price"].sum()

39237.02

## Which is the most orderd items?

## Group by

In [70]:
c = df.groupby("item_name")["quantity"].sum()
c.sort_values(ascending = False).head(5)

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Steak Burrito          386
Canned Soft Drink      351
Name: quantity, dtype: int64

# Unique Value

In [75]:
df.item_name.value_counts().count()

50

In [73]:
df.item_name.nunique()

50

# NUMPY

## random

In [2]:
import numpy as np

# zeros, ones , full , arange , linspace

In [13]:
np.zeros([2,4], dtype= int)

array([[0, 0, 0, 0],
       [0, 0, 0, 0]])

In [14]:
np.ones((3,5), dtype= float)

array([[1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.]])

In [15]:
np.full((3,5),6.6)

array([[6.6, 6.6, 6.6, 6.6, 6.6],
       [6.6, 6.6, 6.6, 6.6, 6.6],
       [6.6, 6.6, 6.6, 6.6, 6.6]])

In [17]:
np.linspace(1,5,22)

array([1.        , 1.19047619, 1.38095238, 1.57142857, 1.76190476,
       1.95238095, 2.14285714, 2.33333333, 2.52380952, 2.71428571,
       2.9047619 , 3.0952381 , 3.28571429, 3.47619048, 3.66666667,
       3.85714286, 4.04761905, 4.23809524, 4.42857143, 4.61904762,
       4.80952381, 5.        ])

In [10]:
# Seed for reproduceibility
np.random.seed(0)

np.random.random((4,9))

array([[0.5488135 , 0.71518937, 0.60276338, 0.54488318],
       [0.4236548 , 0.64589411, 0.43758721, 0.891773  ],
       [0.96366276, 0.38344152, 0.79172504, 0.52889492],
       [0.56804456, 0.92559664, 0.07103606, 0.0871293 ]])

In [18]:
np.random.rand(4,8)

array([[0.61209572, 0.616934  , 0.94374808, 0.6818203 , 0.3595079 ,
        0.43703195, 0.6976312 , 0.06022547],
       [0.66676672, 0.67063787, 0.21038256, 0.1289263 , 0.31542835,
        0.36371077, 0.57019677, 0.43860151],
       [0.98837384, 0.10204481, 0.20887676, 0.16130952, 0.65310833,
        0.2532916 , 0.46631077, 0.24442559],
       [0.15896958, 0.11037514, 0.65632959, 0.13818295, 0.19658236,
        0.36872517, 0.82099323, 0.09710128]])

In [19]:
np.random.normal(0,1,(4,4))

array([[ 0.33367433, -0.02818223,  0.42833187,  0.06651722],
       [ 0.3024719 , -0.63432209, -0.36274117, -0.67246045],
       [-0.35955316, -0.81314628, -1.7262826 ,  0.17742614],
       [-0.40178094, -1.63019835,  0.46278226, -0.90729836]])

In [9]:
np.random.randint(0,10,(4,5))

array([[2, 3, 8, 1, 3],
       [3, 3, 7, 0, 1],
       [9, 9, 0, 4, 7],
       [3, 2, 7, 2, 0]])

# Array indexing and Slicing

In [ ]:
# One dimensional subarray

In [21]:
x1 = np.random.randint(20, size = 6)

In [22]:
x1

array([ 1,  4, 10, 11,  8, 11])

In [24]:
x1[3],x1[2]

(11, 10)

In [25]:
x1[3:]

array([11,  8, 11])

# Multi-dimentional array

In [26]:
x2 = np.random.randint(10,size=(3,4))

In [27]:
x2

array([[2, 3, 0, 0],
       [6, 0, 6, 3],
       [3, 8, 8, 8]])

In [28]:
x2[1][1]

0

In [29]:
x1[:4]

array([ 1,  4, 10, 11])

In [31]:
x1[:4]

array([ 1,  4, 10, 11])

In [32]:
x1[2:4]

array([10, 11])

In [33]:
x1[::2]

array([ 1, 10,  8])

## Reshaping of Array & Transpose

In [39]:
grid = np.arange(1,10)

In [40]:
grid

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [37]:
grid.shape

(9,)

In [38]:
grid.reshape((3,3))

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [41]:
x= np.array([1,2,3])

In [42]:
x.shape

(3,)

In [43]:
x.reshape((1,3))

array([[1, 2, 3]])

In [2]:
import pandas as pd

In [14]:
df = pd.DataFrame([[1, 2], [4, 5], [7,None]],
     index=['cobra', 'viper', 'sidewinder'],
     columns=['max_speed', 'shield'])

In [12]:
df

            max_speed  shield
cobra               1     2.0
viper               4     5.0
sidewinder          7     NaN

In [15]:
df = df.loc[:,['max_speed','shield']]

In [16]:
df

            max_speed  shield
cobra               1     2.0
viper               4     5.0
sidewinder          7     NaN

In [17]:
df.dropna()

       max_speed  shield
cobra          1     2.0
viper          4     5.0